{
  "subject": "ARTI",
  "version": "GY25",
  "purpose": "Undervisningen i ämnet artificiell intelligens ska syfta till att eleverna utvecklar kunskaper om centrala begrepp och tekniker inom AI och ge en introduktion till och överblick av AI och dess tillämpningar. I undervisningen ska eleverna ges möjlighet att utveckla förståelse av hur AI påverkar det dagliga livet och vår bild av omvärlden. Undervisningen ska därför ge eleverna möjlighet att utveckla kunskaper om AI och dess bakomliggande funktionssätt, primära beståndsdelar och uppbyggnad. Eleverna ska även ges möjlighet att utveckla kunskaper om för AI relevanta lagar och andra bestämmelser. På så sätt ska eleverna ges möjlighet att utveckla förmåga att göra juridiska, etiska, ekonomiska och säkerhetsmässiga överväganden inom ämnet. Undervisningen ska belysa tänkbara möjligheter med och konsekvenser av teknikens användning och hur den kan bidra till hållbar utveckling. AI skapas för att efterlikna mänsklig intelligens och därför ska undervisningen ge eleverna möjlighet att utveckla kunskaper om likheter och skillnader mellan den mänskliga intelligensen och den artificiella. Undervisningen ska varva teoretiska moment med praktiska och ge eleverna möjlighet att använda olika digitala verktyg och programvaror samt att programmera. På så vis ska eleverna ges möjlighet att utveckla förståelse av hur AI kan användas i problemlösning och förmåga att omsätta sina kunskaper till praktiska handlingar. Undervisningen ska även lämna utrymme för diskussion om och reflektion över etiska frågor samt olika handlingsalternativ inom artificiell intelligens.",
  "levels": [
    {
      "id": "1",
      "course_code": "ARTI1000X",
      "central_content": [
        "Definition av AI samt centrala begrepp inom området.",
        "Vikten av data, datakvalitet för AI och val av data.",
        "Drivkrafter bakom utvecklingen av AI.",
        "Översikt över användningen av AI, däribland prediktion, robotik, vision och generativ AI samt olika tekniker och metoder som ligger bakom dessa.",
        "Översikt av tekniker för AI, däribland sökning, klassificering och objektigenkänning.",
        "Översikt av metoder och algoritmer inom AI, däribland beslutsträd, regression samt övervakat och oövervakat lärande.",
        "Översikt över processen för problemlösning med AI.",
        "Enklare typ av problemlösning med hjälp av AI, till exempel klassificering, objektigenkänning, prediktion, tolkning och bearbetning av naturligt språk (NLP), enklare maskininlärning och användning av spelagent.",
        "Principer för, och tillämpningar av, vanliga tekniker inom AI, däribland maskininlärning och robotik.",
        "Metoder för enklare träning av AI.",
        "Jämförelse mellan hur enklare lösningar med AI fungerar och hur en människa löser samma problem.",
        "Några situationer där AI är överlägsen människan och tvärtom.",
        "Normer samt lagar och andra bestämmelser som gäller AI och dess användning.",
        "Etiska dilemman med användandet av AI, däribland transparens.",
        "Demokratiska, sociala, ekonomiska, miljömässiga och säkerhetsmässiga möjligheter och risker med AI-användning samt dess konsekvenser för samhället."
      ],
      "requirements": {
        "E": "Eleven visar godtagbara kunskaper om AI, dess tillämpningar, tekniker och beståndsdelar. Eleven använder AI för att lösa enkla problem med viss säkerhet. Eleven gör enkla jämförelser av mänsklig och artificiell intelligens. Eleven redogör på ett godtagbart sätt för lagar och andra bestämmelser som gäller för AI. Eleven för enkla resonemang om möjligheter och risker med AI samt dess konsekvenser för samhället.",
        "C": "Eleven visar goda kunskaper om AI, dess tillämpningar, tekniker och beståndsdelar. Eleven använder AI för att lösa enkla problem med säkerhet. Eleven gör välgrundade jämförelser av mänsklig och artificiell intelligens. Eleven redogör på ett utvecklat sätt för lagar och andra bestämmelser som gäller för AI. Eleven för utvecklade resonemang om möjligheter och risker med AI samt dess konsekvenser för samhället.",
        "A": "Eleven visar mycket goda kunskaper om AI, dess tillämpningar, tekniker och beståndsdelar. Eleven använder AI för att lösa enkla problem med god säkerhet. Eleven gör välgrundade och nyanserade jämförelser av mänsklig och artificiell intelligens. Eleven redogör på ett välutvecklat sätt för lagar och andra bestämmelser som gäller för AI. Eleven för utvecklade och nyanserade resonemang om möjligheter och risker med AI samt dess konsekvenser för samhället."
      },
      "ethical_aspects": [
        "Transparens i beslutsfattande",
        "Bias och rättvisa i dataanvändning",
        "Ansvarsfördelning mellan människa och AI",
        "Etiska dilemman kring datakvalitet och samhällspåverkan"
      ],
      "tool_integrations": [
        "Python-baserade ML-bibliotek som scikit-learn",
        "Visualiseringsverktyg för beslutsträd och regression",
        "Simuleringsverktyg för NLP och robotik"
      ],
      "swedish_legislative_context": "Efterlevnad av GDPR, Dataskyddsförordningen, och kommande svensk implementering av EU AI Act, inklusive riskbedömningar för AI-system.",
      "semantic_tags": ["machine_learning", "ethics", "transparency", "robotics", "nlp"],
      "examples": [
        "Analysera hur en rekommendationsmotor kan förstärka filterbubblor med beslutsträd.",
        "Simulera objektigenkänning i en spelagent för att jämföra med mänsklig perception."
      ],
      "integrations": {
        "GEOG": "AI för klimatprediktion och resursanalys",
        "MATE": "Matematiska algoritmer för regression och neuronnät"
      }
    },
    {
      "id": "2",
      "course_code": "ARTI2000X",
      "central_content": [
        "Användningsområden och arbetssätt för AI inom något område, till exempel sociala medier, sjukvård eller transport.",
        "Tekniker, metoder och algoritmer inom AI.",
        "Tillämpningar inom AI.",
        "Processen för problemlösning med AI, däribland kvalitetssäkring, idrifttagande och underhåll av lösningen.",
        "Problemlösning av mer omfattande karaktär med hjälp av AI, till exempel klassificering, objektigenkänning, prediktion, bearbetning av naturligt språk (NLP) och användning av spelagent.",
        "Algoritmer för problemlösning baserad på AI, till exempel inom maskininlärning, spelagent, prediktion och robotik.",
        "Olika metoders styrkor och svagheter, däribland inom sökning, klassificering och maskininlärning.",
        "Byggstenar för artificiella neuronnät.",
        "Metoder för träning av maskininlärningssystem, däribland märkt och omärkt data samt tränings- och testdata.",
        "Användning och konfigurering av djupa neuronnät.",
        "Värdering av problemlösning gjord av AI, i jämförelse med hur en människa löser samma problem.",
        "Konsekvenser av lagar och andra bestämmelser för AI och dess användning.",
        "Möjligheter med och konsekvenser av AI-användning inom valt område utifrån såväl demokratiska, etiska, sociala, ekonomiska och miljömässiga som säkerhetsmässiga aspekter.",
        "Riskbedömning av AI-användning i olika situationer.",
        "Svagheter i maskininlärning med avseende på transparens, logiska förklaringar på resultatmängd av data, val av data och kvalitet på data."
      ],
      "requirements": {
        "E": "Eleven visar godtagbara kunskaper om AI, dess tillämpningar, tekniker och beståndsdelar. Eleven använder AI för att lösa problem av mer omfattande karaktär med viss säkerhet. Eleven värderar problemlösning gjord av AI i jämförelse med hur en människa löser samma problem på ett godtagbart sätt. Eleven redogör på ett godtagbart sätt för lagar och andra bestämmelser som gäller för AI och värderar konsekvenser av dem. Eleven för enkla resonemang om möjligheter och konsekvenser med AI-användning utifrån olika aspekter samt gör riskbedömningar av AI-användning i olika situationer.",
        "C": "Eleven visar goda kunskaper om AI, dess tillämpningar, tekniker och beståndsdelar. Eleven använder AI för att lösa problem av mer omfattande karaktär med säkerhet. Eleven värderar problemlösning gjord av AI i jämförelse med hur en människa löser samma problem på ett utvecklat sätt. Eleven redogör på ett utvecklat sätt för lagar och andra bestämmelser som gäller för AI och värderar konsekvenser av dem. Eleven för utvecklade resonemang om möjligheter och konsekvenser med AI-användning utifrån olika aspekter samt gör riskbedömningar av AI-användning i olika situationer.",
        "A": "Eleven visar mycket goda kunskaper om AI, dess tillämpningar, tekniker och beståndsdelar. Eleven använder AI för att lösa problem av mer omfattande karaktär med god säkerhet. Eleven värderar problemlösning gjord av AI i jämförelse med hur en människa löser samma problem på ett välutvecklat sätt. Eleven redogör på ett välutvecklat sätt för lagar och andra bestämmelser som gäller för AI och värderar konsekvenser av dem. Eleven för utvecklade och nyanserade resonemang om möjligheter och konsekvenser med AI-användning utifrån olika aspekter samt gör riskbedömningar av AI-användning i olika situationer."
      },
      "ethical_aspects": [
        "Avancerad riskbedömning för AI i samhällssektorer",
        "Konsekvenser av transparensbrister i neuronnät",
        "Etiska värderingar av datahantering och bias i träningsdata"
      ],
      "tool_integrations": [
        "Avancerade ML-ramverk som TensorFlow för neuronnät",
        "Konfigureringsverktyg för djupa nät och testdatahantering"
      ],
      "swedish_legislative_context": "Svensk tillämpning av EU AI Act för hög-risk AI-system, inklusive transparenskrav och riskklassificering.",
      "semantic_tags": ["neural_networks", "risk_assessment", "deep_learning", "ethics"],
      "examples": [
        "Konfigurera ett neuronnät för prediktion i sjukvård och utvärdera etiska risker.",
        "Riskbedöma AI i transportsektorn med fokus på säkerhet och bias."
      ],
      "integrations": {
        "GEOG": "AI för geospatial prediktion i hållbarhetsplanering",
        "MATE": "Algoritmisk optimering för maskininlärning"
      }
    }
  ],
  "comparisons": {
    "gy11": "Ingen dedikerad AI-kurs i GY11; relaterade element integrerades sporadiskt i ämnen som teknik och matematik, utan explicit fokus på etik eller samhällspåverkan.",
    "gy25": "GY25 introducerar ARTI som ett självständigt ämne med stark betoning på praktisk tillämpning, etik och juridik, vilket markerar en modernisering mot digital kompetens."
  }
}
